app/controllers/comments_controller.rb

INSERT INTO "comments" ("caption", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["caption", "hello"], ["user_id", 2], ["post_id", 3], ["created_at", "2020-04-14 23:37:20.104590"], ["updated_at", "2020-04-14 23:37:20.104590"]]
---
  def create
    @comment = @current_user.comments.new(comment_params)

    if @comment.save

UPDATE "comments" SET "caption" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["caption", "test post 4 - has_one :user"], ["updated_at", "2020-04-09 19:21:24.972809"], ["id", 1]]
---
  def update
    if @comment.update(comment_params)