app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("caption", "link_to_product", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["caption", "the bomb"], ["link_to_product", "www.heygirlhey.com"], ["created_at", "2020-04-09 16:22:21.951226"], ["updated_at", "2020-04-09 16:22:21.951226"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "caption" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["caption", "the bomb updated"], ["updated_at", "2020-04-09 16:41:03.284262"], ["id", 1]]